



Open Shortest Path First IGP                              P. Psenak, Ed.
Internet-Draft                                       Cisco Systems, Inc.
Intended status: Standards Track                         S. Previdi, Ed.
Expires: April 24, 2019                                       Individual
                                                        October 21, 2018


                 OSPFv3 Extensions for Segment Routing
          draft-ietf-ospf-ospfv3-segment-routing-extensions-16

Abstract

   Segment Routing (SR) allows a flexible definition of end-to-end paths
   within IGP topologies by encoding paths as sequences of topological
   sub-paths, called "segments".  These segments are advertised by the
   link-state routing protocols (IS-IS and OSPF).

   This draft describes the OSPFv3 extensions required for Segment
   Routing.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 24, 2019.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.




Psenak & Previdi         Expires April 24, 2019                 [Page 1]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Segment Routing Identifiers . . . . . . . . . . . . . . . . .   3
     2.1.  SID/Label Sub-TLV . . . . . . . . . . . . . . . . . . . .   3
   3.  Segment Routing Capabilities  . . . . . . . . . . . . . . . .   4
     3.1.  SR-Algorithm TLV  . . . . . . . . . . . . . . . . . . . .   4
     3.2.  SID/Label Range TLV . . . . . . . . . . . . . . . . . . .   5
     3.3.  SR Local Block TLV  . . . . . . . . . . . . . . . . . . .   7
     3.4.  SRMS Preference TLV . . . . . . . . . . . . . . . . . . .   9
   4.  OSPFv3 Extended Prefix Range TLV  . . . . . . . . . . . . . .  10
   5.  Prefix SID Sub-TLV  . . . . . . . . . . . . . . . . . . . . .  13
   6.  Adjacency Segment Identifier (Adj-SID)  . . . . . . . . . . .  16
     6.1.  Adj-SID Sub-TLV . . . . . . . . . . . . . . . . . . . . .  17
     6.2.  LAN Adj-SID Sub-TLV . . . . . . . . . . . . . . . . . . .  18
   7.  Elements of Procedure . . . . . . . . . . . . . . . . . . . .  19
     7.1.  Intra-area Segment routing in OSPFv3  . . . . . . . . . .  19
     7.2.  Inter-area Segment routing in OSPFv3  . . . . . . . . . .  20
     7.3.  Segment Routing for External Prefixes . . . . . . . . . .  21
     7.4.  Advertisement of Adj-SID  . . . . . . . . . . . . . . . .  22
       7.4.1.  Advertisement of Adj-SID on Point-to-Point Links  . .  22
       7.4.2.  Adjacency SID on Broadcast or NBMA Interfaces . . . .  22
   8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  22
     8.1.  OSPFv3 Extended-LSA TLV Registry  . . . . . . . . . . . .  22
     8.2.  OSPFv3 Extended-LSA Sub-TLV registry  . . . . . . . . . .  23
   9.  Security Considerations . . . . . . . . . . . . . . . . . . .  23
   10. Contributors  . . . . . . . . . . . . . . . . . . . . . . . .  23
   11. References  . . . . . . . . . . . . . . . . . . . . . . . . .  24
     11.1.  Normative References . . . . . . . . . . . . . . . . . .  24
     11.2.  Informative References . . . . . . . . . . . . . . . . .  26
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  26

1.  Introduction

   Segment Routing (SR) allows a flexible definition of end-to-end paths
   within IGP topologies by encoding paths as sequences of topological
   sub-paths, called "segments".  These segments are advertised by the
   link-state routing protocols (IS-IS and OSPF).  Prefix segments



Psenak & Previdi         Expires April 24, 2019                 [Page 2]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   represent an ECMP-aware shortest-path to a prefix (or a node), as per
   the state of the IGP topology.  Adjacency segments represent a hop
   over a specific adjacency between two nodes in the IGP.  A prefix
   segment is typically a multi-hop path while an adjacency segment, in
   most cases, is a one-hop path.  SR's control-plane can be applied to
   both IPv6 and MPLS data-planes, and does not require any additional
   signalling (other than IGP extensions).  The IPv6 data plane is out
   of the scope of this specification - OSPFv3 extension for SR with
   IPv6 data plane will be specified in a separate document.  When used
   in MPLS networks, SR paths do not require any LDP or RSVP-TE
   signalling.  However, SR can interoperate in the presence of LSPs
   established with RSVP or LDP.

   There are additional segment types, e.g., Binding SID defined in
   [RFC8402].

   This draft describes the OSPFv3 extensions required for Segment
   Routing with MPLS data plane.

   Segment Routing architecture is described in [RFC8402].

   Segment Routing use cases are described in [RFC7855].

2.  Segment Routing Identifiers

   Segment Routing defines various types of Segment Identifiers (SIDs):
   Prefix-SID, Adjacency-SID, LAN Adjacency SID, and Binding SID.

2.1.  SID/Label Sub-TLV

   The SID/Label Sub-TLV appears in multiple TLVs or Sub-TLVs defined
   later in this document.  It is used to advertise the SID or label
   associated with a prefix or adjacency.  The SID/Label Sub-TLV has
   following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |              Length           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      SID/Label (variable)                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:

      Type: 7

      Length: Variable, 3 or 4 octets



Psenak & Previdi         Expires April 24, 2019                 [Page 3]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


      SID/Label: If length is set to 3, then the 20 rightmost bits
      represent a label.  If length is set to 4, then the value
      represents a 32-bit SID.

      The receiving router MUST ignore the SID/Label Sub-TLV if the
      length is other then 3 or 4.

3.  Segment Routing Capabilities

   Segment Routing requires some additional router capabilities to be
   advertised to other routers in the area.

   These SR capabilities are advertised in the OSPFv3 Router Information
   Opaque LSA (defined in [RFC7770]).

3.1.  SR-Algorithm TLV

   The SR-Algorithm TLV is a top-level TLV of the OSPFv3 Router
   Information Opaque LSA (defined in [RFC7770]).

   The SR-Algorithm TLV is optional.  It SHOULD only be advertised once
   in the OSPFv3 Router Information Opaque LSA.  If the SR-Algorithm TLV
   is not advertised by the node, such node is considered as not being
   segment routing capable.

   An SR router can use various algorithms when calculating reachability
   to OSPFv3 routers or prefixes in an OSPFv3 area.  Examples of these
   algorithms are metric-based Shortest Path First (SPF), various
   flavors of Constrained SPF, etc.  The SR-Algorithm TLV allows a
   router to advertise the algorithms currently used by the router to
   other routers in an OSPFv3 area.  The SR-Algorithm TLV has following
   format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Type               |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Algorithm 1  |  Algorithm... |  Algorithm n  |               |
   +-                                                             -+
   |                                                               |
   +                                                               +

   where:

      Type: 8





Psenak & Previdi         Expires April 24, 2019                 [Page 4]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


      Length: Variable, in octets, dependent on number of algorithms
      advertised.

      Algorithm: Single octet identifying the algorithm.  Algorithms are
      defined in "IGP Algorithm Type" registry under "Interior Gateway
      Protocol (IGP) Parameters", defined in
      [I-D.ietf-ospf-segment-routing-extensions].

   When multiple SR-Algorithm TLVs are received from a given router, the
   receiver MUST use the first occurrence of the TLV in the OSPFv3
   Router Information Opaque LSA.  If the SR-Algorithm TLV appears in
   multiple OSPFv3 Router Information Opaque LSAs that have different
   flooding scopes, the SR-Algorithm TLV in the OSPFv3 Router
   Information Opaque LSA with the area-scoped flooding scope MUST be
   used.  If the SR-Algorithm TLV appears in multiple OSPFv3 Router
   Information Opaque LSAs that have the same flooding scope, the SR-
   Algorithm TLV in the OSPFv3 Router Information Opaque LSA with the
   numerically smallest Instance ID MUST be used and subsequent
   instances of the SR-Algorithm TLV MUST be ignored.

   The OSPFv3 Router Information Opaque LSA can be advertised at any of
   the defined opaque flooding scopes (link, area, or Autonomous System
   (AS)).  For the purpose of SR-Algorithm TLV advertisement, area-
   scoped flooding is REQUIRED.

3.2.  SID/Label Range TLV

   Prefix SIDs MAY be advertised in a form of an index as described in
   Section 5.  Such index defines the offset in the SID/Label space
   advertised by the router.  The SID/Label Range TLV is used to
   advertise such SID/Label space.

   The SID/Label Range TLV is a top-level TLV of the OSPFv3 Router
   Information Opaque LSA (defined in [RFC7770]).

   The SID/Label Range TLV MAY appear multiple times and has the
   following format:














Psenak & Previdi         Expires April 24, 2019                 [Page 5]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |               Type            |               Length          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Range Size               |   Reserved    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     Sub-TLVs (variable)                       |
   +-                                                             -+
   |                                                               |
   +                                                               +

   where:

      Type: 9

      Length: Variable, in octets, dependent on Sub-TLVs.

      Range Size: 3-octet SID/label range size (i.e., the number of SIDs
      or labels in the range including the first SID/label).  It MUST be
      greater than 0.

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

   Initially, the only supported Sub-TLV is the SID/Label Sub-TLV as
   defined in Section 2.1.  The SID/Label Sub-TLV MUST be included in
   the SID/Label Range TLV.  The SID/Label advertised in the SID/Label
   Sub-TLV represents the first SID/Label in the advertised range.

   Only a single SID/Label Sub-TLV MAY be advertised in SID/Label Range
   TLV.  If more then one SID/Label Sub-TLVs are present, the SID/Label
   Range TLV MUST be ignored.

   Multiple occurrences of the SID/Label Range TLV MAY be advertised, in
   order to advertise multiple ranges.  In such case:

   o  The originating router MUST encode each range into a different
      SID/Label Range TLV.

   o  The originating router decides the order in which the set of SID/
      Label Range TLVs are advertised inside the Router Information
      Opaque LSA.  The originating router MUST ensure the order is the
      same after a graceful restart (using checkpointing, non-volatile
      storage, or any other mechanism) in order to assure the SID/label
      range and SID index correspondence is preserved across graceful
      restarts.




Psenak & Previdi         Expires April 24, 2019                 [Page 6]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   o  The receiving router MUST adhere to the order in which the ranges
      are advertised when calculating a SID/label from a SID index.

   o  The originating router MUST NOT advertise overlapping ranges.

   o  When a router receives multiple overlapping ranges, it MUST
      conform to the procedures defined in
      [I-D.ietf-spring-segment-routing-mpls].

   The following example illustrates the advertisement of multiple
   ranges:

      The originating router advertises the following ranges:

         Range 1: Range Size: 100   SID/Label Sub-TLV: 100
         Range 1: Range Size: 100   SID/Label Sub-TLV: 1000
         Range 1: Range Size: 100   SID/Label Sub-TLV: 500

      The receiving routers concatenate the ranges and build the Segment
      Routing Global Block (SRGB) as follows:

      SRGB = [100, 199]
             [1000, 1099]
             [500, 599]

      The indexes span multiple ranges:

         index=0 means label 100
         ...
         index 99 means label 199
         index 100 means label 1000
         index 199 means label 1099
         ...
         index 200 means label 500
         ...

   The OSPFv3 Router Information Opaque LSA can be advertised at any of
   the defined flooding scopes (link, area, or autonomous system (AS)).
   For the purpose of SID/Label Range TLV advertisement, area-scoped
   flooding is REQUIRED.

3.3.  SR Local Block TLV

   The SR Local Block TLV (SRLB TLV) contains the range of labels the
   node has reserved for local SIDs.  SIDs from the SRLB MAY be used for
   Adjacency-SIDs, but also by components other than the OSPFv3
   protocol.  As an example, an application or a controller can instruct
   the router to allocate a specific local SID.  Some controllers or



Psenak & Previdi         Expires April 24, 2019                 [Page 7]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   applications can use the control plane to discover the available set
   of local SIDs on a particular router.  In such cases, the SRLB is
   advertised in the control plane.  The requirement to advertise the
   SRLB is further described in [I-D.ietf-spring-segment-routing-mpls].
   The SRLB TLV is used to advertise the SRLB.

   The SRLB TLV is a top-level TLV of the OSPFv3 Router Information
   Opaque LSA (defined in [RFC7770]).

   The SRLB TLV MAY appear multiple times in the OSPFv3 Router
   Information Opaque LSA and has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Range Size                 |   Reserved    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Sub-TLVs (variable)                    |
   +-                                                             -+
   |                                                               |
   +                                                               +

   where:

      Type: 14

      Length: Variable, in octets, dependent on Sub-TLVs.

      Range Size: 3-octet SID/label range size (i.e., the number of SIDs
      or labels in the range including the first SID/label).  It MUST be
      greater than 0.

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

   Initially, the only supported Sub-TLV is the SID/Label Sub-TLV as
   defined in Section 2.1.  The SID/Label Sub-TLV MUST be included in
   the SRLB TLV.  The SID/Label advertised in the SID/Label Sub-TLV
   represents the first SID/Label in the advertised range.

   Only a single SID/Label Sub-TLV MAY be advertised in the SRLB TLV.
   If more then one SID/Label Sub-TLVs are present, the SRLB TLV MUST be
   ignored.

   The originating router MUST NOT advertise overlapping ranges.




Psenak & Previdi         Expires April 24, 2019                 [Page 8]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   Each time a SID from the SRLB is allocated, it SHOULD also be
   reported to all components (e.g., controller or applications) in
   order for these components to have an up-to-date view of the current
   SRLB allocation.  This is required to avoid collisions between
   allocation instructions.

   Within the context of OSPFv3, the reporting of local SIDs is done
   through OSPFv3 Sub-TLVs such as the Adjacency-SID (Section 6).
   However, the reporting of allocated local SIDs can also be done
   through other means and protocols which are outside the scope of this
   document.

   A router advertising the SRLB TLV MAY also have other label ranges,
   outside of the SRLB, used for its local allocation purposes which are
   not advertised in the SRLB TLV.  For example, it is possible that an
   Adjacency-SID is allocated using a local label that is not part of
   the SRLB.

   The OSPFv3 Router Information Opaque LSA can be advertised at any of
   the defined flooding scopes (link, area, or autonomous system (AS)).
   For the purpose of SRLB TLV advertisement, area-scoped flooding is
   REQUIRED.

3.4.  SRMS Preference TLV

   The Segment Routing Mapping Server Preference TLV (SRMS Preference
   TLV) is used to advertise a preference associated with a node that
   acts as an SR Mapping Server.  The role of an SRMS is described in
   [I-D.ietf-spring-segment-routing-ldp-interop].  SRMS preference is
   defined in [I-D.ietf-spring-segment-routing-ldp-interop].

   The SRMS Preference TLV is a top-level TLV of the OSPFv3 Router
   Information Opaque LSA (defined in [RFC7770]).

   The SRMS Preference TLV MAY only be advertised once in the OSPFv3
   Router Information Opaque LSA and has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Preference  |                 Reserved                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:

      Type: 15



Psenak & Previdi         Expires April 24, 2019                 [Page 9]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


      Length: 4 octets

      Preference: 1 octet.  SRMS preference value from 0 to 255.

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

   When multiple SRMS Preference TLVs are received from a given router,
   the receiver MUST use the first occurrence of the TLV in the OSPFv3
   Router Information Opaque LSA.  If the SRMS Preference TLV appears in
   multiple OSPFv3 Router Information Opaque LSAs that have different
   flooding scopes, the SRMS Preference TLV in the OSPFv3 Router
   Information Opaque LSA with the narrowest flooding scope MUST be
   used.  If the SRMS Preference TLV appears in multiple OSPFv3 Router
   Information Opaque LSAs that have the same flooding scope, the SRMS
   Preference TLV in the OSPFv3 Router Information Opaque LSA with the
   numerically smallest Instance ID MUST be used and subsequent
   instances of the SRMS Preference TLV MUST be ignored.

   The OSPFv3 Router Information Opaque LSA can be advertised at any of
   the defined flooding scopes (link, area, or autonomous system (AS)).
   For the purpose of the SRMS Preference TLV advertisement, AS-scoped
   flooding SHOULD be used.  This is because SRMS servers can be located
   in different areas than consumers of the SRMS advertisements.  If
   SRMS advertisements from an SRMS server are only used inside the SRMS
   server's area, area-scoped flooding MAY be used.

4.  OSPFv3 Extended Prefix Range TLV

   In some cases it is useful to advertise attributes for a range of
   prefixes.  The Segment Routing Mapping Server, which is described in
   [I-D.ietf-spring-segment-routing-ldp-interop], is an example of where
   we need a single advertisement to advertise SIDs for multiple
   prefixes from a contiguous address range.

   The OSPFv3 Extended Prefix Range TLV is defined for this purpose.

   The OSPFv3 Extended Prefix Range TLV is a top-level TLV of the
   following LSAs defined in [RFC8362]:

      E-Intra-Area-Prefix-LSA

      E-Inter-Area-Prefix-LSA

      E-AS-External-LSA

      E-Type-7-LSA




Psenak & Previdi         Expires April 24, 2019                [Page 10]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   Multiple OSPFv3 Extended Prefix Range TLVs MAY be advertised in each
   LSA mentioned above.  The OSPFv3 Extended Prefix Range TLV has the
   following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Prefix Length |       AF      |         Range Size            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Flags      |                 Reserved                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     Address Prefix (variable)                 |
   |                           ...                                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Sub-TLVs (variable)                      |
   +-                                                             -+
   |                                                               |

   where:

      Type: 9

      Length: Variable, in octets, dependent on Sub-TLVs.

      Prefix length: Length of prefix in bits.

      AF: Address family for the prefix.

         AF: 0 - IPv4 unicast

         AF: 1 - IPv6 unicast

      Range size: Represents the number of prefixes that are covered by
      the advertisement.  The Range Size MUST NOT exceed the number of
      prefixes that could be satisfied by the prefix length without
      including:

         Addresses from the IPv4 multicast address range (224.0.0.0/3),
         if the AF is IPv4 unicast

         Addresses other than the IPv6 unicast addresses, if the AF is
         IPv6 unicast

      Flags: Single octet field.  The following flags are defined:





Psenak & Previdi         Expires April 24, 2019                [Page 11]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


     0  1  2  3  4  5  6  7
   +--+--+--+--+--+--+--+--+
   |IA|  |  |  |  |  |  |  |
   +--+--+--+--+--+--+--+--+

   where:

         IA-Flag: Inter-Area flag.  If set, advertisement is of inter-
         area type.  An Are Border Router (ABR) that is advertising the
         OSPFv3 Extended Prefix Range TLV between areas MUST set this
         bit.

         This bit is used to prevent redundant flooding of Prefix Range
         TLVs between areas as follows:

            An ABR only propagates an inter-area Prefix Range
            advertisement from the backbone area to connected non-
            backbone areas if the advertisement is considered to be the
            best one.  The following rules are used to select the best
            range from the set of advertisements for the same Prefix
            Range:

               An ABR always prefers intra-area Prefix Range
               advertisements over inter-area advertisements.

               An ABR does not consider inter-area Prefix Range
               advertisements coming from non-backbone areas.

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

      Address Prefix:

         For the address family IPv4 unicast, the prefix itself is
         encoded as a 32-bit value.  The default route is represented by
         a prefix of length 0.

         For the address family IPv6 unicast, the prefix, encoded as an
         even multiple of 32-bit words, padded with zeroed bits as
         necessary.  This encoding consumes ((PrefixLength + 31) / 32)
         32-bit words.

         Prefix encoding for other address families is beyond the scope
         of this specification.

   If the OSPFv3 Extended Prefix Range TLVs advertising the exact same
   range appears in multiple LSAs of the same type, originated by the
   same OSPFv3 router, the LSA with the numerically smallest Instance ID



Psenak & Previdi         Expires April 24, 2019                [Page 12]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   MUST be used and subsequent instances of the OSPFv3 Extended Prefix
   Range TLVs MUST be ignored.

5.  Prefix SID Sub-TLV

   The Prefix SID Sub-TLV is a Sub-TLV of the following OSPFv3 TLVs as
   defined in [RFC8362] and in Section 4:

      Intra-Area Prefix TLV

      Inter-Area Prefix TLV

      External Prefix TLV

      OSPFv3 Extended Prefix Range TLV

   It MAY appear more than once in the parent TLV and has the following
   format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |               Type            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Flags     |  Algorithm    |           Reserved            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       SID/Index/Label (variable)              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   where:

      Type: 4

      Length: 7 or 8 octets, dependent on the V-flag

      Flags: Single octet field.  The following flags are defined:


     0  1  2  3  4  5  6  7
   +--+--+--+--+--+--+--+--+
   |  |NP|M |E |V |L |  |  |
   +--+--+--+--+--+--+--+--+
   where:

         NP-Flag: No-PHP flag.  If set, then the penultimate hop MUST
         NOT pop the Prefix-SID before delivering packets to the node
         that advertised the Prefix-SID.





Psenak & Previdi         Expires April 24, 2019                [Page 13]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


         M-Flag: Mapping Server Flag.  If set, the SID was advertised by
         a Segment Routing Mapping Server as described in
         [I-D.ietf-spring-segment-routing-ldp-interop].

         E-Flag: Explicit-Null Flag.  If set, any upstream neighbor of
         the Prefix-SID originator MUST replace the Prefix-SID with the
         Explicit-NULL label (0 for IPv4, 2 for IPv6) before forwarding
         the packet.

         V-Flag: Value/Index Flag.  If set, then the Prefix-SID carries
         an absolute value.  If not set, then the Prefix-SID carries an
         index.

         L-Flag: Local/Global Flag.  If set, then the value/index
         carried by the Prefix-SID has local significance.  If not set,
         then the value/index carried by this Sub-TLV has global
         significance.

         Other bits: Reserved.  These MUST be zero when sent and are
         ignored when received.

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

      Algorithm: Single octet identifying the algorithm the Prefix-SID
      is associated with as defined in Section 3.1.

      A router receiving a Prefix-SID from a remote node and with an
      algorithm value that such remote node has not advertised in the
      SR-Algorithm Sub-TLV (Section 3.1) MUST ignore the Prefix-SID Sub-
      TLV.

      SID/Index/Label: According to the V and L flags, it contains
      either:

         A 32-bit index defining the offset in the SID/Label space
         advertised by this router.

         A 24-bit label where the 20 rightmost bits are used for
         encoding the label value.

   If an OSPFv3 router advertises multiple Prefix-SIDs for the same
   prefix, topology, and algorithm, all of them MUST be ignored.

   When calculating the outgoing label for the prefix, the router MUST
   take into account, as described below, the E, NP, and M flags
   advertised by the next-hop router if that router advertised the SID




Psenak & Previdi         Expires April 24, 2019                [Page 14]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   for the prefix.  This MUST be done regardless of whether the next-hop
   router contributes to the best path to the prefix.

   The NP-Flag (No-PHP) MUST be set and the E-flag MUST be clear for
   Prefix-SIDs allocated to prefixes that are propagated between areas
   by an ABR based on intra-area or inter-area reachability, unless the
   advertised prefix is directly attached to such ABR.

   The NP-Flag (No-PHP) MUST be set and the E-flag MUST be clear for
   Prefix-SIDs allocated to redistributed prefixes, unless the
   redistributed prefix is directly attached to the advertising
   Autonomous System Boundary Router (ASBR).

   If the NP-Flag is not set, then any upstream neighbor of the Prefix-
   SID originator MUST pop the Prefix-SID.  This is equivalent to the
   penultimate hop popping mechanism used in the MPLS dataplane.  If the
   NP-flag is not set, then the received E-flag is ignored.

   If the NP-flag is set then:

      If the E-flag is not set, then any upstream neighbor of the
      Prefix-SID originator MUST keep the Prefix-SID on top of the
      stack.  This is useful when the originator of the Prefix-SID needs
      to stitch the incoming packet into a continuing MPLS LSP to the
      final destination.  This could occur at an Area Border Router
      (prefix propagation from one area to another) or at an AS Boundary
      Router (prefix propagation from one domain to another).

      If the E-flag is set, then any upstream neighbor of the Prefix-SID
      originator MUST replace the Prefix-SID with an Explicit-NULL
      label.  This is useful, e.g., when the originator of the Prefix-
      SID is the final destination for the related prefix and the
      originator wishes to receive the packet with the original EXP
      bits.

   When the M-Flag is set, the NP-flag and the E-flag MUST be ignored on
   reception.

   As the Mapping Server does not specify the originator of a prefix
   advertisement, it is not possible to determine PHP behavior solely
   based on the Mapping Server advertisement.  However, PHP behavior
   SHOULD be done in following cases:

      The Prefix is intra-area type and the downstream neighbor is the
      originator of the prefix.






Psenak & Previdi         Expires April 24, 2019                [Page 15]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


      The Prefix is inter-area type and the downstream neighbor is an
      ABR, which is advertising prefix reachability and is setting the
      LA-bit in the Prefix Options as described in [RFC8362].

      The Prefix is external type and the downstream neighbor is an
      ASBR, which is advertising prefix reachability and is setting the
      LA-bit in the Prefix Options as described in [RFC8362].

   When a Prefix-SID is advertised in the OSPFv3 Extended Prefix Range
   TLV, then the value advertised in the Prefix SID Sub-TLV is
   interpreted as a starting SID/Label value.

   Example 1: If the following router addresses (loopback addresses)
   need to be mapped into the corresponding Prefix SID indexes:

             Router-A: 2001:DB8::1/128, Prefix-SID: Index 1
             Router-B: 2001:DB8::2/128, Prefix-SID: Index 2
             Router-C: 2001:DB8::3/128, Prefix-SID: Index 3
             Router-D: 2001:DB8::4/128, Prefix-SID: Index 4

   then the Address Prefix field in the OSPFv3 Extended Prefix Range TLV
   would be set to 2001:DB8::1, the Prefix Length would be set to 128,
   the Range Size would be set to 4, and the Index value in the Prefix-
   SID Sub-TLV would be set to 1.

   Example 2: If the following prefixes need to be mapped into the
   corresponding Prefix-SID indexes:

             2001:DB8:1::0/120,   Prefix-SID: Index 51
             2001:DB8:1::100/120, Prefix-SID: Index 52
             2001:DB8:1::200/120, Prefix-SID: Index 53
             2001:DB8:1::300/120, Prefix-SID: Index 54
             2001:DB8:1::400/120, Prefix-SID: Index 55
             2001:DB8:1::500/120, Prefix-SID: Index 56
             2001:DB8:1::600/120, Prefix-SID: Index 57

   then the Prefix field in the OSPFv3 Extended Prefix Range TLV would
   be set to 2001:DB8:1::0, the Prefix Length would be set to 120, the
   Range Size would be set to 7, and the Index value in the Prefix-SID
   Sub-TLV would be set to 51.

6.  Adjacency Segment Identifier (Adj-SID)

   An Adjacency Segment Identifier (Adj-SID) represents a router
   adjacency in Segment Routing.






Psenak & Previdi         Expires April 24, 2019                [Page 16]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


6.1.  Adj-SID Sub-TLV

   The Adj-SID Sub-TLV is an optional Sub-TLV of the Router-Link TLV as
   defined in [RFC8362].  It MAY appear multiple times in the Router-
   Link TLV.  The Adj-SID Sub-TLV has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |               Type            |              Length           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Flags         |     Weight    |             Reserved          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   SID/Label/Index (variable)                  |
   +---------------------------------------------------------------+

   where:

      Type: 5

      Length: 7 or 8 octets, dependent on the V flag.

      Flags: Single octet field containing the following flags:

    0 1 2 3 4 5 6 7
   +-+-+-+-+-+-+-+-+
   |B|V|L|G|P|     |
   +-+-+-+-+-+-+-+-+

   where:

         B-Flag: Backup Flag.  If set, the Adj-SID refers to an
         adjacency that is eligible for protection (e.g., using IPFRR or
         MPLS-FRR) as described in section 3.5 of [RFC8402].

         The V-Flag: Value/Index Flag.  If set, then the Adj-SID carries
         an absolute value.  If not set, then the Adj-SID carries an
         index.

         The L-Flag: Local/Global Flag.  If set, then the value/index
         carried by the Adj-SID has local significance.  If not set,
         then the value/index carried by this Sub-TLV has global
         significance.

         The G-Flag: Group Flag.  When set, the G-Flag indicates that
         the Adj-SID refers to a group of adjacencies (and therefore MAY
         be assigned to other adjacencies as well).




Psenak & Previdi         Expires April 24, 2019                [Page 17]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


         P-Flag.  Persistent flag.  When set, the P-Flag indicates that
         the Adj-SID is persistently allocated, i.e., the Adj-SID value
         remains the same across router restart and/or interface flap.

         Other bits: Reserved.  These MUST be zero when sent and are
         ignored when received.

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

      Weight: Weight used for load-balancing purposes.  The use of the
      weight is defined in [RFC8402].

      SID/Index/Label: According to the V and L flags, it contains
      either:

         A 32-bit index defining the offset in the SID/Label space
         advertised by this router.

         A 24-bit label where the 20 rightmost bits are used for
         encoding the label value.

   An SR-capable router MAY allocate an Adj-SID for each of its
   adjacencies and set the B-Flag when the adjacency is eligible for
   protection by an FRR mechanism (IP or MPLS) as described in
   [RFC8402].

   An SR-capable router MAY allocate more than one Adj-SID to an
   adjacency.

   An SR-capable router MAY allocate the same Adj-SID to different
   adjacencies.

   When the P-flag is not set, the Adj-SID MAY be persistent.  When the
   P-flag is set, the Adj-SID MUST be persistent.

6.2.  LAN Adj-SID Sub-TLV

   The LAN Adj-SID Sub-TLV is an optional Sub-TLV of the Router-Link
   TLV.  It MAY appear multiple times in the Router-Link TLV.  It is
   used to advertise a SID/Label for an adjacency to a non-DR router on
   a broadcast, NBMA, or hybrid [RFC6845] network.









Psenak & Previdi         Expires April 24, 2019                [Page 18]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Flags     |     Weight    |            Reserved           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                           Neighbor ID                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    SID/Label/Index (variable)                 |
   +---------------------------------------------------------------+

   where:

      Type: 6

      Length: 11 or 12 octets, dependent on V-flag.

      Flags: same as in Section 6.1

      Weight: Weight used for load-balancing purposes.  The use of the
      weight is defined in [RFC8402].

      Reserved: SHOULD be set to 0 on transmission and MUST be ignored
      on reception.

      Neighbor ID: The Router ID of the neighbor for which the LAN-Adj-
      SID is advertised.

      SID/Index/Label: According to the V and L flags, it contains
      either:

         A 32-bit index defining the offset in the SID/Label space
         advertised by this router.

         A 24-bit label where the 20 rightmost bits are used for
         encoding the label value.

      When the P-flag is not set, the Adj-SID MAY be persistent.  When
      the P-flag is set, the Adj-SID MUST be persistent.

7.  Elements of Procedure

7.1.  Intra-area Segment routing in OSPFv3

   An OSPFv3 router that supports segment routing MAY advertise Prefix-
   SIDs for any prefix to which it is advertising reachability (e.g., a
   loopback IP address as described in Section 5).



Psenak & Previdi         Expires April 24, 2019                [Page 19]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   A Prefix-SID can also be advertised by SR Mapping Servers (as
   described in [I-D.ietf-spring-segment-routing-ldp-interop]).  A
   Mapping Server advertises Prefix-SIDs for remote prefixes that exist
   in the OSPFv3 routing domain.  Multiple Mapping Servers can advertise
   Prefix-SIDs for the same prefix, in which case the same Prefix-SID
   MUST be advertised by all of them.  The SR Mapping Server could use
   either area flooding scope or autonomous system flooding scope when
   advertising Prefix SIDs for prefixes, based on the configuration of
   the SR Mapping Server.  Depending on the flooding scope used, the SR
   Mapping Server chooses the OSPFv3 LSA type that will be used.  If the
   area flooding scope is needed, an E-Intra-Area-Prefix-LSA [RFC8362]
   is used.  If autonomous system flooding scope is needed, an E-AS-
   External-LSA [RFC8362] is used.

   When a Prefix-SID is advertised by the Mapping Server, which is
   indicated by the M-flag in the Prefix-SID Sub-TLV (Section 5), the
   route type as implied by the LSA type is ignored and the Prefix-SID
   is bound to the corresponding prefix independent of the route type.

   Advertisement of the Prefix-SID by the Mapping Server using an Inter-
   Area Prefix TLV, External-Prefix TLV, or Intra-Area-Prefix TLV
   [RFC8362] does not itself contribute to the prefix reachability.  The
   NU-bit MUST be set in the PrefixOptions field of the LSA which is
   used by the Mapping Server to advertise SID or SID Range, which
   prevents the advertisement from contributing to prefix reachability.

   An SR Mapping Server MUST use the OSPFv3 Extended Prefix Range TLVs
   when advertising SIDs for prefixes.  Prefixes of different route-
   types can be combined in a single OSPFv3 Extended Prefix Range TLV
   advertised by an SR Mapping Server.

   Area-scoped OSPFv3 Extended Prefix Range TLVs are propagated between
   areas.  Similar to propagation of prefixes between areas, an ABR only
   propagates the OSPFv3 Extended Prefix Range TLV that it considers to
   be the best from the set it received.  The rules used to pick the
   best OSPFv3 Extended Prefix Range TLV are described in Section 4.

   When propagating an OSPFv3 Extended Prefix Range TLV between areas,
   ABRs MUST set the IA-Flag, that is used to prevent redundant flooding
   of the OSPFv3 Extended Prefix Range TLV between areas as described in
   Section 4.

7.2.  Inter-area Segment routing in OSPFv3

   In order to support SR in a multi-area environment, OSPFv3 MUST
   propagate Prefix-SID information between areas.  The following
   procedure is used to propagate Prefix SIDs between areas.




Psenak & Previdi         Expires April 24, 2019                [Page 20]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   When an OSPFv3 ABR advertises an Inter-Area-Prefix-LSA from an intra-
   area prefix to all its connected areas, it will also include the
   Prefix-SID Sub-TLV, as described in Section 5.  The Prefix-SID value
   will be set as follows:

      The ABR will look at its best path to the prefix in the source
      area and find the advertising router associated with the best path
      to that prefix.

      The ABR will then determine if such router advertised a Prefix-SID
      for the prefix and use it when advertising the Prefix-SID to other
      connected areas.

      If no Prefix-SID was advertised for the prefix in the source area
      by the router that contributes to the best path to the prefix, the
      originating ABR will use the Prefix-SID advertised by any other
      router when propagating the Prefix-SID for the prefix to other
      areas.

   When an OSPFv3 ABR advertises Inter-Area-Prefix-LSA LSAs from an
   inter-area route to all its connected areas, it will also include the
   Prefix-SID Sub-TLV, as described in Section 5.  The Prefix-SID value
   will be set as follows:

      The ABR will look at its best path to the prefix in the backbone
      area and find the advertising router associated with the best path
      to that prefix.

      The ABR will then determine if such router advertised a Prefix-SID
      for the prefix and use it when advertising the Prefix-SID to other
      connected areas.

      If no Prefix-SID was advertised for the prefix in the backbone
      area by the ABR that contributes to the best path to the prefix,
      the originating ABR will use the Prefix-SID advertised by any
      other router when propagating the Prefix-SID for the prefix to
      other areas.

7.3.  Segment Routing for External Prefixes

   AS-External-LSAs are flooded domain wide.  When an ASBR, which
   supports SR, originates an E-AS-External-LSA, it SHOULD also include
   a Prefix-SID Sub-TLV, as described in Section 5.  The Prefix-SID
   value will be set to the SID that has been reserved for that prefix.

   When an NSSA [RFC3101] ABR translates an E-NSSA-LSA into an E-AS-
   External-LSA, it SHOULD also advertise the Prefix-SID for the prefix.
   The NSSA ABR determines its best path to the prefix advertised in the



Psenak & Previdi         Expires April 24, 2019                [Page 21]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   translated E-NSSA-LSA and finds the advertising router associated
   with that path.  If the advertising router has advertised a Prefix-
   SID for the prefix, then the NSSA ABR uses it when advertising the
   Prefix-SID for the E-AS-External-LSA.  Otherwise, the Prefix-SID
   advertised by any other router will be used.

7.4.  Advertisement of Adj-SID

   The Adjacency Segment Routing Identifier (Adj-SID) is advertised
   using the Adj-SID Sub-TLV as described in Section 6.

7.4.1.  Advertisement of Adj-SID on Point-to-Point Links

   An Adj-SID MAY be advertised for any adjacency on a P2P link that is
   in neighbor state 2-Way or higher.  If the adjacency on a P2P link
   transitions from the FULL state, then the Adj-SID for that adjacency
   MAY be removed from the area.  If the adjacency transitions to a
   state lower then 2-Way, then the Adj-SID advertisement MUST be
   withdrawn from the area.

7.4.2.  Adjacency SID on Broadcast or NBMA Interfaces

   Broadcast, NBMA, or hybrid [RFC6845] networks in OSPFv3 are
   represented by a star topology where the Designated Router (DR) is
   the central point to which all other routers on the broadcast, NBMA,
   or hybrid network connect.  As a result, routers on the broadcast,
   NBMA, or hybrid network advertise only their adjacency to the DR.
   Routers that do not act as DR do not form or advertise adjacencies
   with each other.  They do, however, maintain 2-Way adjacency state
   with each other and are directly reachable.

   When Segment Routing is used, each router on the broadcast, NBMA, or
   hybrid network MAY advertise the Adj-SID for its adjacency to the DR
   using the Adj-SID Sub-TLV as described in Section 6.1.

   SR-capable routers MAY also advertise a LAN-Adj-SID for other
   neighbors (e.g., BDR, DR-OTHER) on the broadcast, NBMA, or hybrid
   network using the LAN-Adj-SID Sub-TLV as described in Section 6.2.

8.  IANA Considerations

   This specification updates several existing OSPFv3 registries.

8.1.  OSPFv3 Extended-LSA TLV Registry

   Following values are allocated:

   o 9 - OSPFv3 Extended Prefix Range TLV



Psenak & Previdi         Expires April 24, 2019                [Page 22]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


8.2.  OSPFv3 Extended-LSA Sub-TLV registry

   o 4 - Prefix SID Sub-TLV

   o 5 - Adj-SID Sub-TLV

   o 6 - LAN Adj-SID Sub-TLV

   o 7 - SID/Label Sub-TLV

9.  Security Considerations

   With the OSPFv3 segment routing extensions defined herein, OSPFv3
   will now program the MPLS data plane [RFC3031].  Previously, LDP
   [RFC5036] or another label distribution mechanism was required to
   advertise MPLS labels and program the MPLS data plane.

   In general, the same types of attacks that can be carried out on the
   IP control plane can be carried out on the MPLS control plane
   resulting in traffic being misrouted in the respective data planes.
   However, the latter can be more difficult to detect and isolate.

   Existing security extensions as described in [RFC5340] and [RFC8362]
   apply to these segment routing extensions.  While OSPFv3 is under a
   single administrative domain, there can be deployments where
   potential attackers have access to one or more networks in the OSPFv3
   routing domain.  In these deployments, stronger authentication
   mechanisms such as those specified in [RFC4552] or [RFC7166] SHOULD
   be used.

   Implementations MUST assure that malformed TLV and Sub-TLV defined in
   this document are detected and do not provide a vulnerability for
   attackers to crash the OSPFv3 router or routing process.  Reception
   of a malformed TLV or Sub-TLV SHOULD be counted and/or logged for
   further analysis.  Logging of malformed TLVs and Sub-TLVs SHOULD be
   rate-limited to prevent a Denial of Service (DoS) attack (distributed
   or otherwise) from overloading the OSPFv3 control plane.

10.  Contributors

   The following people gave a substantial contribution to the content
   of this document and should be considered as co-authors:









Psenak & Previdi         Expires April 24, 2019                [Page 23]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


      Clarence Filsfils
      Cisco Systems, Inc.
      Brussels
      Belgium

      Email: cfilsfil@cisco.com

      Hannes Gredler
      RtBrick Inc.
      Austria

      Email: hannes@rtbrick.com

      Rob Shakir
      Google, Inc.
      1600 Amphitheatre Parkway
      Mountain View, CA  94043
      US

      Email: robjs@google.com

      Wim Henderickx
      Nokia
      Copernicuslaan 50
      Antwerp  2018
      BE

      Email: wim.henderickx@nokia.com

      Jeff Tantsura
      Nuage Networks
      US

      Email: jefftant.ietf@gmail.com


   Thanks to Acee Lindem for his substantial contribution to the content
   of this document.

   We would like to thank Anton Smirnov for his contribution as well.

11.  References

11.1.  Normative References







Psenak & Previdi         Expires April 24, 2019                [Page 24]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   [I-D.ietf-ospf-segment-routing-extensions]
              Psenak, P., Previdi, S., Filsfils, C., Gredler, H.,
              Shakir, R., Henderickx, W., and J. Tantsura, "OSPF
              Extensions for Segment Routing", draft-ietf-ospf-segment-
              routing-extensions-25 (work in progress), April 2018.

   [I-D.ietf-spring-segment-routing-ldp-interop]
              Bashandy, A., Filsfils, C., Previdi, S., Decraene, B., and
              S. Litkowski, "Segment Routing interworking with LDP",
              draft-ietf-spring-segment-routing-ldp-interop-15 (work in
              progress), September 2018.

   [I-D.ietf-spring-segment-routing-mpls]
              Bashandy, A., Filsfils, C., Previdi, S., Decraene, B.,
              Litkowski, S., and R. Shakir, "Segment Routing with MPLS
              data plane", draft-ietf-spring-segment-routing-mpls-14
              (work in progress), June 2018.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC3031]  Rosen, E., Viswanathan, A., and R. Callon, "Multiprotocol
              Label Switching Architecture", RFC 3031,
              DOI 10.17487/RFC3031, January 2001,
              <https://www.rfc-editor.org/info/rfc3031>.

   [RFC3101]  Murphy, P., "The OSPF Not-So-Stubby Area (NSSA) Option",
              RFC 3101, DOI 10.17487/RFC3101, January 2003,
              <https://www.rfc-editor.org/info/rfc3101>.

   [RFC5036]  Andersson, L., Ed., Minei, I., Ed., and B. Thomas, Ed.,
              "LDP Specification", RFC 5036, DOI 10.17487/RFC5036,
              October 2007, <https://www.rfc-editor.org/info/rfc5036>.

   [RFC5340]  Coltun, R., Ferguson, D., Moy, J., and A. Lindem, "OSPF
              for IPv6", RFC 5340, DOI 10.17487/RFC5340, July 2008,
              <https://www.rfc-editor.org/info/rfc5340>.

   [RFC6845]  Sheth, N., Wang, L., and J. Zhang, "OSPF Hybrid Broadcast
              and Point-to-Multipoint Interface Type", RFC 6845,
              DOI 10.17487/RFC6845, January 2013,
              <https://www.rfc-editor.org/info/rfc6845>.







Psenak & Previdi         Expires April 24, 2019                [Page 25]

Internet-Draft    OSPFv3 Extensions for Segment Routing     October 2018


   [RFC7770]  Lindem, A., Ed., Shen, N., Vasseur, JP., Aggarwal, R., and
              S. Shaffer, "Extensions to OSPF for Advertising Optional
              Router Capabilities", RFC 7770, DOI 10.17487/RFC7770,
              February 2016, <https://www.rfc-editor.org/info/rfc7770>.

   [RFC8362]  Lindem, A., Roy, A., Goethals, D., Reddy Vallem, V., and
              F. Baker, "OSPFv3 Link State Advertisement (LSA)
              Extensibility", RFC 8362, DOI 10.17487/RFC8362, April
              2018, <https://www.rfc-editor.org/info/rfc8362>.

   [RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing Architecture", RFC 8402, DOI 10.17487/RFC8402,
              July 2018, <https://www.rfc-editor.org/info/rfc8402>.

11.2.  Informative References

   [RFC4552]  Gupta, M. and N. Melam, "Authentication/Confidentiality
              for OSPFv3", RFC 4552, DOI 10.17487/RFC4552, June 2006,
              <https://www.rfc-editor.org/info/rfc4552>.

   [RFC7166]  Bhatia, M., Manral, V., and A. Lindem, "Supporting
              Authentication Trailer for OSPFv3", RFC 7166,
              DOI 10.17487/RFC7166, March 2014,
              <https://www.rfc-editor.org/info/rfc7166>.

   [RFC7855]  Previdi, S., Ed., Filsfils, C., Ed., Decraene, B.,
              Litkowski, S., Horneffer, M., and R. Shakir, "Source
              Packet Routing in Networking (SPRING) Problem Statement
              and Requirements", RFC 7855, DOI 10.17487/RFC7855, May
              2016, <https://www.rfc-editor.org/info/rfc7855>.

Authors' Addresses

   Peter Psenak (editor)
   Cisco Systems, Inc.
   Eurovea Centre, Central 3
   Pribinova Street 10
   Bratislava  81109
   Slovakia

   Email: ppsenak@cisco.com


   Stefano Previdi (editor)
   Individual

   Email: stefano.previdi@net



Psenak & Previdi         Expires April 24, 2019                [Page 26]
